Old Simulations/engineSimOne - Copy/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0); 


boundaryField
{
    outlet
    {
        type            waveTransmissive;
		gamma 			1.14;
	}
    inlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            noSlip;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
